cases/ansys_verification/VMFL063/case/0/p
FoamFile { version 2.0; format ascii; class volScalarField; object p; }
dimensions      [0 2 -2 0 0 0 0];   // kinematic pressure, rho = 1 kg/m3
internalField   uniform 0;
boundaryField
{
    inlet        { type zeroGradient; }
    outlet       { type fixedValue; value uniform 0; }
    centreline   { type symmetryPlane; }
    plateFace    { type zeroGradient; }
    plateTop     { type zeroGradient; }
    farfield     { type symmetryPlane; }
    frontAndBack { type empty; }
}
