cases/ansys_verification/VMFL063/case/constant/transportProperties
FoamFile { version 2.0; format ascii; class dictionary; object transportProperties; }
// VM2026R1 p.193: density 1 kg/m3, viscosity 1.7894e-5 kg/m-s => nu = mu/rho = 1.7894e-5 m2/s
// Re_2t = rho*U*2t/mu = 1*0.0517*0.090/1.7894e-5 = 260.03  (manual states Re = 260)
transportModel  Newtonian;
nu              1.7894e-05;
