cases/ansys_verification/VMFL063/case/system/controlDict.template
FoamFile { version 2.0; format ascii; class dictionary; object controlDict; }
application     simpleFoam;
startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         __ENDTIME__;
deltaT          1;
writeControl    runTime;
writeInterval   __ENDTIME__;
purgeWrite      0;
writeFormat     ascii;
writePrecision  12;
timeFormat      general;
timePrecision   10;
runTimeModifiable false;

functions
{
    // tau_w / rho on the plate top surface. Written at write time, i.e. at the
    // residualControl-terminated stop. The reattachment length LR is the LAST
    // reversed->attached crossing of its x-component inside the frozen window.
    wallShearStress
    {
        type            wallShearStress;
        libs            ("libfieldFunctionObjects.so");
        patches         (plateTop);
        writeControl    writeTime;
        executeControl  writeTime;
    }
}
